#+title: Sprint Backlog 00 for Niam
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- create football manager program

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-03-06 Tue 09:22]
| <75>                                                                        |          |        |      |       |
| Headline                                                                    | Time     |        |      |     % |
|-----------------------------------------------------------------------------+----------+--------+------+-------|
| *Total time*                                                                | *144:49* |        |      | 100.0 |
|-----------------------------------------------------------------------------+----------+--------+------+-------|
| Stories                                                                     | 144:49   |        |      | 100.0 |
| Active                                                                      |          | 144:49 |      | 100.0 |
| STARTED Sprint and product backlog grooming                                 |          |        | 0:58 |   0.7 |
| COMPLETED Add gpg                                                           |          |        | 1:32 |   1.1 |
| COMPLETED Test commits to branch                                            |          |        | 0:28 |   0.3 |
| COMPLETED Test verification                                                 |          |        | 0:21 |   0.2 |
| COMPLETED Practice branches                                                 |          |        | 1:05 |   0.7 |
| COMPLETED Fix travis                                                        |          |        | 0:33 |   0.4 |
| COMPLETED Create main                                                       |          |        | 0:26 |   0.3 |
| COMPLETED Build main                                                        |          |        | 2:10 |   1.5 |
| COMPLETED Discuss task                                                      |          |        | 0:31 |   0.4 |
| COMPLETED Create a Menu class                                               |          |        | 0:52 |   0.6 |
| COMPLETED Fix menu class                                                    |          |        | 1:41 |   1.2 |
| COMPLETED Research classes                                                  |          |        | 1:49 |   1.3 |
| COMPLETED Add new option to list                                            |          |        | 0:19 |   0.2 |
| COMPLETED Create players class                                              |          |        | 0:21 |   0.2 |
| POSTPONED Fix player class                                                  |          |        | 2:00 |   1.4 |
| STARTED create setup function in player class                               |          |        | 1:30 |   1.0 |
| STARTED create display function in player class                             |          |        | 0:20 |   0.2 |
| COMPLETED Create vector for players                                         |          |        | 1:00 |   0.7 |
| COMPLETED Read through fixed player class                                   |          |        | 1:07 |   0.8 |
| COMPLETED Research classes                                                  |          |        | 2:56 |   2.0 |
| COMPLETED Dealing with conflicts in magit                                   |          |        | 2:19 |   1.6 |
| COMPLETED Practice implementing class with functions                        |          |        | 0:26 |   0.3 |
| COMPLETED Research classes                                                  |          |        | 1:41 |   1.2 |
| COMPLETED Add detail to players                                             |          |        | 1:00 |   0.7 |
| COMPLETED Add new player                                                    |          |        | 0:46 |   0.5 |
| COMPLETED Show detail of select player only                                 |          |        | 0:29 |   0.3 |
| COMPLETED Discuss task                                                      |          |        | 0:33 |   0.4 |
| COMPLETED Add the rest of the players                                       |          |        | 0:39 |   0.4 |
| COMPLETED Testing program                                                   |          |        | 1:00 |   0.7 |
| COMPLETED Learning about pointers- videos                                   |          |        | 1:00 |   0.7 |
| COMPLETED Pointers - research                                               |          |        | 1:30 |   1.0 |
| COMPLETED Pointers - tutorials                                              |          |        | 1:00 |   0.7 |
| COMPLETED Pointers - examples                                               |          |        | 0:45 |   0.5 |
| COMPLETED Pointers - program                                                |          |        | 0:46 |   0.5 |
| COMPLETED Testing program                                                   |          |        | 0:45 |   0.5 |
| COMPLETED Discussing program                                                |          |        | 0:30 |   0.3 |
| COMPLETED Review pointers                                                   |          |        | 1:00 |   0.7 |
| COMPLETED Research pointers to data structures                              |          |        | 1:01 |   0.7 |
| COMPLETED Pointers with array program                                       |          |        | 0:56 |   0.6 |
| COMPLETED Data structures reading                                           |          |        | 0:54 |   0.6 |
| COMPLETED Pointers and classes                                              |          |        | 1:00 |   0.7 |
| COMPLETED Pointers and classes program                                      |          |        | 0:34 |   0.4 |
| COMPLETED Review                                                            |          |        | 0:44 |   0.5 |
| COMPLETED Discussing tasks                                                  |          |        | 0:07 |   0.1 |
| COMPLETED Pointers practice                                                 |          |        | 1:11 |   0.8 |
| COMPLETED Pointers, classes, - employee program                             |          |        | 0:56 |   0.6 |
| COMPLETED Split employee program up                                         |          |        | 1:14 |   0.9 |
| COMPLETED Looking at PGs program                                            |          |        | 0:28 |   0.3 |
| COMPLETED Testing employee program                                          |          |        | 1:04 |   0.7 |
| COMPLETED comparing w/ PG                                                   |          |        | 0:23 |   0.3 |
| COMPLETED Add another function to employee program                          |          |        | 1:09 |   0.8 |
| COMPLETED Research class constructors                                       |          |        | 1:00 |   0.7 |
| COMPLETED Help PG split files                                               |          |        | 0:28 |   0.3 |
| COMPLETED Class constructor and multiple files Video                        |          |        | 0:54 |   0.6 |
| COMPLETED Make another object                                               |          |        | 0:23 |   0.3 |
| COMPLETED Allow user to add employee/object                                 |          |        | 0:56 |   0.6 |
| COMPLETED Discuss tasks                                                     |          |        | 0:30 |   0.3 |
| COMPLETED Research tasks                                                    |          |        | 0:36 |   0.4 |
| COMPLETED Watch classes video                                               |          |        | 0:53 |   0.6 |
| COMPLETED Employee IO program                                               |          |        | 1:03 |   0.7 |
| COMPLETED Test Employee IO program                                          |          |        | 1:00 |   0.7 |
| COMPLETED Review player class in FM                                         |          |        | 0:38 |   0.4 |
| COMPLETED Discuss tasks                                                     |          |        | 0:13 |   0.1 |
| COMPLETED Discuss code                                                      |          |        | 0:40 |   0.5 |
| COMPLETED Read about Object oriented programming                            |          |        | 0:42 |   0.5 |
| COMPLETED Start league class                                                |          |        | 0:48 |   0.6 |
| COMPLETED Add league class to main                                          |          |        | 0:30 |   0.3 |
| COMPLETED Discuss tasks                                                     |          |        | 0:30 |   0.3 |
| COMPLETED Review changes                                                    |          |        | 1:06 |   0.8 |
| COMPLETED Add more team data to league                                      |          |        | 0:37 |   0.4 |
| COMPLETED Testing                                                           |          |        | 1:02 |   0.7 |
| COMPLETED Review code/research tasks                                        |          |        | 1:01 |   0.7 |
| COMPLETED Start game class                                                  |          |        | 1:00 |   0.7 |
| COMPLETED Discuss game and look through code                                |          |        | 1:19 |   0.9 |
| COMPLETED Add game to main                                                  |          |        | 0:23 |   0.3 |
| COMPLETED Read MC sample game                                               |          |        | 0:25 |   0.3 |
| COMPLETED Build and test MC game                                            |          |        | 1:00 |   0.7 |
| COMPLETED Research parts of code                                            |          |        | 0:33 |   0.4 |
| COMPLETED Research IO/Myfile                                                |          |        | 0:40 |   0.5 |
| COMPLETED Review sample program                                             |          |        | 2:00 |   1.4 |
| COMPLETED Fix league class                                                  |          |        | 0:51 |   0.6 |
| COMPLETED Check through program for errors                                  |          |        | 1:00 |   0.7 |
| COMPLETED Practice IO                                                       |          |        | 1:00 |   0.7 |
| COMPLETED Fix league                                                        |          |        | 0:53 |   0.6 |
| COMPLETED Look through sample main                                          |          |        | 0:45 |   0.5 |
| COMPLETED Review changes                                                    |          |        | 0:15 |   0.2 |
| COMPLETED Add league function to main                                       |          |        | 0:56 |   0.6 |
| COMPLETED Fix travis error                                                  |          |        | 0:25 |   0.3 |
| COMPLETED Fix travis error                                                  |          |        | 0:15 |   0.2 |
| COMPLETED Make practice files                                               |          |        | 1:30 |   1.0 |
| COMPLETED Make player class                                                 |          |        | 1:00 |   0.7 |
| COMPLETED Implement player class                                            |          |        | 0:56 |   0.6 |
| COMPLETED Discuss solution for view players based on team                   |          |        | 1:00 |   0.7 |
| COMPLETED Try to implement a solution                                       |          |        | 1:52 |   1.3 |
| COMPLETED Review program                                                    |          |        | 1:00 |   0.7 |
| COMPLETED Discuss tasks/changes                                             |          |        | 0:30 |   0.3 |
| COMPLETED Add team data files                                               |          |        | 0:44 |   0.5 |
| COMPLETED Discuss solution to league table                                  |          |        | 0:45 |   0.5 |
| COMPLETED Research I/O for files                                            |          |        | 0:45 |   0.5 |
| COMPLETED Test current program                                              |          |        | 0:40 |   0.5 |
| COMPLETED Watch videos about read/write custom files                        |          |        | 0:59 |   0.7 |
| COMPLETED Write program to practice reading custom files                    |          |        | 0:40 |   0.5 |
| COMPLETED Watch read/write videos                                           |          |        | 1:46 |   1.2 |
| COMPLETED Add variables to read/write program                               |          |        | 1:18 |   0.9 |
| POSTPONED Add class to read/write program                                   |          |        | 3:32 |   2.4 |
| COMPLETED Research about istream/fstream                                    |          |        | 1:02 |   0.7 |
| COMPLETED Review table.cpp                                                  |          |        | 0:30 |   0.3 |
| COMPLETED Discuss tasks/data model                                          |          |        | 0:30 |   0.3 |
| COMPLETED Review sample program                                             |          |        | 1:10 |   0.8 |
| COMPLETED Watch OOP videos                                                  |          |        | 1:34 |   1.1 |
| COMPLETED Review OOP videos                                                 |          |        | 0:55 |   0.6 |
| COMPLETED Read OOP tutorial                                                 |          |        | 1:14 |   0.9 |
| COMPLETED Read std::sort                                                    |          |        | 0:37 |   0.4 |
| COMPLETED Read std::find                                                    |          |        | 0:57 |   0.7 |
| COMPLETED Discuss tasks                                                     |          |        | 0:55 |   0.6 |
| COMPLETED Create player class                                               |          |        | 0:27 |   0.3 |
| COMPLETED Fix data model                                                    |          |        | 0:50 |   0.6 |
| COMPLETED Look at PGs diagram                                               |          |        | 0:30 |   0.3 |
| COMPLETED Attempt to fix build                                              |          |        | 1:37 |   1.1 |
| COMPLETED Watch istream/fsteeam/getline video                               |          |        | 1:30 |   1.0 |
| COMPLETED Review code                                                       |          |        | 0:30 |   0.3 |
| COMPLETED watch getline video 2                                             |          |        | 1:00 |   0.7 |
| COMPLETED Watch OOP video                                                   |          |        | 1:00 |   0.7 |
| COMPLETED Review diagram                                                    |          |        | 0:40 |   0.5 |
| COMPLETED Review program                                                    |          |        | 1:30 |   1.0 |
| COMPLETED watch oop playlist                                                |          |        | 1:00 |   0.7 |
| COMPLETED Discuss tasks                                                     |          |        | 1:51 |   1.3 |
| COMPLETED Review PG changes                                                 |          |        | 0:15 |   0.2 |
| COMPLETED Practice using variables from file                                |          |        | 4:25 |   3.0 |
| COMPLETED Watch OOP video                                                   |          |        | 0:31 |   0.4 |
| POSTPONED Display players of 1 team                                         |          |        | 4:00 |   2.8 |
| COMPLETED Discuss tasks                                                     |          |        | 0:21 |   0.2 |
| COMPLETED Watch oop video                                                   |          |        | 0:53 |   0.6 |
| COMPLETED Research objects in memory                                        |          |        | 3:57 |   2.7 |
| COMPLETED Research class objects/ research getline                          |          |        | 2:31 |   1.7 |
| COMPLETED Discus tasks                                                      |          |        | 0:30 |   0.3 |
| COMPLETED Research getline                                                  |          |        | 0:31 |   0.4 |
| COMPLETED Add team code to main project                                     |          |        | 0:40 |   0.5 |
| COMPLETED Review program and changes                                        |          |        | 1:50 |   1.3 |
| COMPLETED Attempt to fix table                                              |          |        | 3:10 |   2.2 |
| COMPLETED Review table                                                      |          |        | 1:00 |   0.7 |
| COMPLETED Discuss tasks                                                     |          |        | 0:30 |   0.3 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:


*** COMPLETED Sprint and product backlog grooming                     :story:
    CLOSED: [2018-03-06 Tue 09:23]
    CLOCK: [2018-01-30 Tue 09:00]--[2018-01-30 Tue 09:58] =>  0:58

Updates to sprint and product backlog

*** COMPLETED Magit
    CLOSED: [2018-01-30 Tue 09:20]

Simple branching workflow:

 - make sure you have ido-mode on as it makes it much easier to select
   the branches.
 - create a new branch in magit: Type b c. The starting point should be
   master. Then give it a name (e.g. development).
 - do work as usual, commit etc. When you want to push:
   1. first make sure all files have been either committed or stashed.
   2. Then in magit type b b master to change to master.
   3. Then pull master with F u.
   4. Then go back to your branch with b b development.
   5. Rebase the branch. In magit r e master.
   6. now go back to master b b master.
   7. merge your branch into master: m m development.
   8. if all has gone well, you can push master to remote: P u.
   9. go back to your branch and do work.

Links:

- [[https://github.com/jkitchin/magit-tutorial][Magit Tutorial]]
- [[https://vickychijwani.me/magit-part-i/][Other Magit Tutorial part I]], [[https://vickychijwani.me/magit-part-ii/][Part II]]

*** COMPLETED Add gpg
    CLOSED: [2018-01-29 Mon 14:38]
   CLOCK: [2018-01-29 Mon 9:00]--[2018-01-29 Mon 10:32] =>  1:32
- added gpg key
- started branch

*** COMPLETED Test commits to branch
    CLOSED: [2018-01-29 Mon 14:38]
   CLOCK: [2018-01-29 Mon 10:32]--[2018-01-29 Mon 11:00] =>  0:28

Test branch by commits

*** COMPLETED Test verification
    CLOSED: [2018-01-29 Mon 14:39]
   CLOCK: [2018-01-29 Mon 11:00]--[2018-01-29 Mon 11:21] =>  0:21

Test key verification through commits

*** COMPLETED Add Travis support for project
    CLOSED: [2018-01-29 Mon 16:54]

Travis automatically builds your project every time you do a commit.

- Log in to travis using your github account (this has to be done by
  Niam): https://travis-ci.org/. Create a project for Football
  Manager.
- Create a file called .travis.yml on the top directory of your
  project. See [[https://ledentsov.de/2013/07/06/setting-travis-ci-with-github-for-a-c-project-for-the-first-time-cpp/][Setting travis-ci with github for a c++ project for the
  first time]]
- add an emblem to your readme file. This should appear on your travis
  project, as per article above.

*** COMPLETED Practice branches
    CLOSED: [2018-01-29 Mon 14:39]
   CLOCK: [2018-01-29 Mon 11:30]--[2018-01-29 Mon 12:35] =>  1:05

Change branch, commit, merge, push, repeat

*** COMPLETED Fix travis
    CLOSED: [2018-01-29 Mon 14:39]
    CLOCK: [2018-01-29 Mon 12:35]--[2018-01-29 Mon 13:08] =>  0:33

Changed travis.yml file - chnaged to master(branch).

*** COMPLETED Create a simple main for project                        :story:
    CLOSED: [2018-01-29 Mon 16:50]

Built program using main file, CMakeLists, and .travis.yml

*** COMPLETED Create main
    CLOSED: [2018-01-29 Mon 16:10]
    CLOCK: [2018-01-29 Mon 14:10]--[2018-01-29 Mon 14:36] =>  0:26

Create a main.cpp - output hello

*** COMPLETED Build main
    CLOSED: [2018-01-29 Mon 16:50]
    CLOCK: [2018-01-29 Mon 14:40]--[2018-01-29 Mon 16:50] =>  2:10

- move folders
- push, pull
- fix travis file

*** COMPLETED Discuss task
    CLOSED: [2018-01-30 Tue 10:31]
    CLOCK: [2018-01-30 Tue 10:00]--[2018-01-30 Tue 10:31] =>  0:31

*** COMPLETED Create a Menu class
    CLOSED: [2018-01-30 Tue 11:23]
    CLOCK: [2018-01-30 Tue 10:31]--[2018-01-30 Tue 11:23] =>  0:52

*** COMPLETED Fix menu class
    CLOSED: [2018-01-30 Tue 14:04]
    CLOCK: [2018-01-30 Tue 11:23]--[2018-01-30 Tue 13:04] =>  1:41

*** COMPLETED Research classes
    CLOSED: [2018-02-01 Thu 09:21]
    CLOCK: [2018-01-30 Tue 16:00]--[2018-01-30 Tue 16:27] =>  0:27
    CLOCK: [2018-01-30 Tue 14:04]--[2018-01-30 Tue 15:26] =>  1:22

*** COMPLETED Add new option to list
    CLOSED: [2018-01-30 Tue 15:46]
    CLOCK: [2018-01-30 Tue 15:27]--[2018-01-30 Tue 15:46] =>  0:19

*** COMPLETED Create players class
    CLOSED: [2018-01-30 Tue 16:50]
    CLOCK: [2018-01-30 Tue 16:28]--[2018-01-30 Tue 16:49] =>  0:21

*** POSTPONED Fix player class
    CLOSED: [2018-01-31 Wed 11:58]
    CLOCK: [2018-01-31 Wed 09:00]--[2018-01-31 Wed 11:00] =>  2.00

*** COMPLETED create setup function in player class
    CLOSED: [2018-03-06 Tue 09:23]
    CLOCK: [2018-01-31 Wed 11:00]--[2018-01-31 Wed 12:30] =>  1:30
*** COMPLETED create display function in player class
    CLOSED: [2018-03-06 Tue 09:23]
    CLOCK: [2018-01-31 Wed 13:30]--[2018-01-31 Wed 13:50] =>  0:20
add both functions to main

*** COMPLETED Create vector for players
    CLOSED: [2018-01-31 Wed 15:27]
    CLOCK: [2018-01-31 Wed 14:27]--[2018-01-31 Wed 15:27] =>  1:00
made a vector, which contained players, which are then displayed.
*** COMPLETED Read through fixed player class
    CLOSED: [2018-01-31 Wed 16:52]
    CLOCK: [2018-01-31 Wed 15:45]--[2018-01-31 Wed 16:52] =>  1:07
read through MCs changes
*** COMPLETED Research classes
    CLOSED: [2018-02-02 Fri 10:11]
    CLOCK: [2018-02-01 Thu 10:25]--[2018-02-01 Thu 12:00] =>  1:35
    CLOCK: [2018-02-01 Thu 09:00]--[2018-02-01 Thu 10:21] =>  1:21
www.learncpp.com
*** COMPLETED Dealing with conflicts in magit
    CLOSED: [2018-02-02 Fri 10:11]
    CLOCK: [2018-02-01 Thu 13:30]--[2018-02-01 Thu 15:49] =>  2:19
fixing git conflicts
*** COMPLETED Practice implementing class with functions
    CLOSED: [2018-02-01 Thu 16:26]
    CLOCK: [2018-02-01 Thu 16:00]--[2018-02-01 Thu 16:26] =>  0:26
implement the class and function from learncpp, and split it up into seperate files.

*** COMPLETED Research classes
    CLOSED: [2018-02-02 Fri 10:41]
    CLOCK: [2018-02-02 Fri 09:00]--[2018-02-02 Fri 10:41] =>  1:41
*** COMPLETED Add detail to players
    CLOSED: [2018-02-02 Fri 14:05]
    CLOCK: [2018-02-02 Fri 10:44]--[2018-02-02 Fri 11:44] =>  1:00
Made it so that it shows all player properties
*** COMPLETED Add new player
    CLOSED: [2018-02-02 Fri 14:06]
    CLOCK: [2018-02-02 Fri 11:44]--[2018-02-02 Fri 12:30] =>  0:46
Added a new player to the program using player class
*** COMPLETED Show detail of select player only
    CLOSED: [2018-02-02 Fri 14:36]
    CLOCK: [2018-02-02 Fri 14:07]--[2018-02-02 Fri 14:36] =>  0:29
when selecting a player only that players details are shown
*** COMPLETED Discuss task
    CLOSED: [2018-02-02 Fri 15:09]
    CLOCK: [2018-02-02 Fri 14:36]--[2018-02-02 Fri 15:09] =>  0:33
Discussing next task
*** COMPLETED Add the rest of the players
    CLOSED: [2018-02-02 Fri 15:51]
    CLOCK: [2018-02-02 Fri 15:12]--[2018-02-02 Fri 15:51] =>  0:39
Added the rest of the players that can be selected
*** COMPLETED Testing program
    CLOSED: [2018-02-05 Mon 09:12]
    CLOCK: [2018-02-02 Fri 16:00]--[2018-02-02 Fri 17:00] => 1:0
tested changes to program
*** COMPLETED Learning about pointers- videos
    CLOSED: [2018-02-05 Mon 14:10]
    CLOCK: [2018-02-05 Mon 09:00]--[2018-02-05 Mon 10:00] =>  1:00
  https://www.youtube.com/watch?v=W0aE-w61Cb8
  https://www.youtube.com/watch?v=CSVRA4_xOkw
*** COMPLETED Pointers - research
    CLOSED: [2018-02-05 Mon 14:12]
    CLOCK: [2018-02-05 Mon 10:00]--[2018-02-05 Mon 11:30] =>  1:30
 https://gist.github.com/ericandrewlewis/720c374c29bbafadedc9
 http://www.learncpp.com/cpp-tutorial/67-introduction-to-pointers/
 http://www.hellgeeks.com/pointers-in-c/
*** COMPLETED Pointers - tutorials
    CLOSED: [2018-02-05 Mon 14:14]
    CLOCK: [2018-02-05 Mon 11:30]--[2018-02-05 Mon 12:30] =>  1:00
 http://www.cplusplus.com/doc/tutorial/pointers/
 http://www.learncpp.com/cpp-tutorial/67-introduction-to-pointers/
*** COMPLETED Pointers - examples
    CLOSED: [2018-02-05 Mon 15:46]
    CLOCK: [2018-02-05 Mon 14:00]--[2018-02-05 Mon 14:45] =>  0:45
Researching program examples of pointers - best one:http://www.cplusplus.com/forum/beginner/8894/

*** COMPLETED Pointers - program
    CLOSED: [2018-02-05 Mon 15:47]
    CLOCK: [2018-02-05 Mon 15:00]--[2018-02-05 Mon 15:46] =>  0:46
Implemented program, showing how pointers work.
*** COMPLETED Testing program
    CLOSED: [2018-02-05 Mon 16:39]
    CLOCK: [2018-02-05 Mon 15:45]--[2018-02-05 Mon 16:30] =>  0:45
changing things in program to test
*** COMPLETED Discussing program
    CLOSED: [2018-02-06 Tue 10:28]
    CLOCK: [2018-02-05 Mon 16:30]--[2018-02-05 Mon 17:00] =>  0:30
Discussed program with PG
*** COMPLETED Review pointers
    CLOSED: [2018-02-06 Tue 10:29]
    CLOCK: [2018-02-06 Tue 09:00]--[2018-02-06 Tue 10:00] =>  1:00
Review previous work
*** COMPLETED Research pointers to data structures
    CLOSED: [2018-02-06 Tue 11:30]
    CLOCK: [2018-02-06 Tue 10:29]--[2018-02-06 Tue 11:30] =>  1:01
https://www.geeksforgeeks.org/overview-of-data-structures-set-1-linear-data-structures/
*** COMPLETED Pointers with array program
    CLOSED: [2018-02-06 Tue 12:26]
    CLOCK: [2018-02-06 Tue 11:30]--[2018-02-06 Tue 12:26] =>  0:56
mad a program which used a pointer to pint to an item in array
*** COMPLETED Data structures reading
    CLOSED: [2018-02-06 Tue 15:00]
    CLOCK: [2018-02-06 Tue 14:06]--[2018-02-06 Tue 15:00] =>  0:54
https://www.geeksforgeeks.org/data-structures/
*** COMPLETED Pointers and classes
    CLOSED: [2018-02-06 Tue 16:11]
    CLOCK: [2018-02-06 Tue 15:00]--[2018-02-06 Tue 16:00] =>  1:00
https://www.tutorialspoint.com/cplusplus/cpp_pointer_to_class.htm
*** COMPLETED Pointers and classes program
    CLOSED: [2018-02-06 Tue 16:45]
    CLOCK: [2018-02-06 Tue 16:11]--[2018-02-06 Tue 16:45] =>  0:34
made a program which used pointers to class obejects
*** COMPLETED Review
    CLOSED: [2018-02-07 Wed 09:44]
    CLOCK: [2018-02-07 Wed 09:00]--[2018-02-07 Wed 09:44] =>  0:44
Review previous work
*** COMPLETED Discussing tasks
    CLOSED: [2018-02-07 Wed 09:54]
    CLOCK: [2018-02-07 Wed 09:47]--[2018-02-07 Wed 09:54] =>  0:07
http://condor.depaul.edu/ntomuro/courses/309/notes/pointer_exercises.html
http://www.worldbestlearningcenter.com/index_files/cpp-pointers-exercises.htm
https://www.doc.ic.ac.uk/~wjk/c++Intro/RobMillerE7.html
http://www.tulane.edu/~mpuljic/cpp/savitch/chapter12
https://erlerobotics.gitbooks.io/erle-robotics-cpp-gitbook/pointers/exercises_pointers.html

*** COMPLETED Pointers practice
    CLOSED: [2018-02-07 Wed 11:07]
    CLOCK: [2018-02-07 Wed 09:56]--[2018-02-07 Wed 11:07] =>  1:11
http://www.worldbestlearningcenter.com/index_files/cpp-pointers-exercises.htm
*** COMPLETED Pointers, classes, - employee program
    CLOSED: [2018-02-07 Wed 12:15]
    CLOCK: [2018-02-07 Wed 11:19]--[2018-02-07 Wed 12:15] =>  0:56
made employee program
*** COMPLETED Split employee program up
    CLOSED: [2018-02-07 Wed 14:44]
    CLOCK: [2018-02-07 Wed 13:30]--[2018-02-07 Wed 14:44] =>  1:14
split up previous program into translation units

*** COMPLETED Looking at PGs program
    CLOSED: [2018-02-07 Wed 15:13]
    CLOCK: [2018-02-07 Wed 14:45]--[2018-02-07 Wed 15:13] =>  0:28
Looked at  PGs program/errors
*** COMPLETED Testing employee program
    CLOSED: [2018-02-07 Wed 16:18]
    CLOCK: [2018-02-07 Wed 15:14]--[2018-02-07 Wed 16:18] =>  1:04
Tested employee program, to check if it works.
*** COMPLETED comparing w/ PG
    CLOSED: [2018-02-07 Wed 16:36]
    CLOCK: [2018-02-07 Wed 16:22]--[2018-02-07 Wed 16:45] =>  0:23
comparing code
*** COMPLETED Add another function to employee program
    CLOSED: [2018-02-08 Thu 10:10]
    CLOCK: [2018-02-08 Thu 09:00]--[2018-02-08 Thu 10:09] =>  1:09
Adding tax function
*** COMPLETED Research class constructors
    CLOSED: [2018-02-08 Thu 11:35]
    CLOCK: [2018-02-08 Thu 10:15]--[2018-02-08 Thu 11:15] =>  1:00
Researching class constructors
*** COMPLETED Help PG split files
    CLOSED: [2018-02-08 Thu 11:59]
    CLOCK: [2018-02-08 Thu 11:30]--[2018-02-08 Thu 11:58] =>  0:28

*** COMPLETED Class constructor and multiple files Video
    CLOSED: [2018-02-08 Thu 14:15]
    CLOCK: [2018-02-08 Thu 12:06]--[2018-02-08 Thu 13:00] =>  0:54
https://www.youtube.com/watch?v=CT2k4KbAQpo
*** COMPLETED Make another object
    CLOSED: [2018-02-08 Thu 14:23]
    CLOCK: [2018-02-08 Thu 14:00]--[2018-02-08 Thu 14:23] =>  0:23
Add object to program
*** COMPLETED Allow user to add employee/object
    CLOSED: [2018-02-08 Thu 15:21]
    CLOCK: [2018-02-08 Thu 14:25]--[2018-02-08 Thu 15:21] =>  0:56
Use user input to create object
*** COMPLETED Discuss tasks
    CLOSED: [2018-02-08 Thu 16:38]
    CLOCK: [2018-02-08 Thu 15:30]--[2018-02-08 Thu 16:00] =>  0:30

*** COMPLETED Research tasks
    CLOSED: [2018-02-09 Fri 09:36]
    CLOCK: [2018-02-09 Fri 09:00]--[2018-02-09 Fri 09:36] =>  0:36

*** COMPLETED Watch classes video
    CLOSED: [2018-02-09 Fri 10:53]
    CLOCK: [2018-02-09 Fri 09:37]--[2018-02-09 Fri 10:30] =>  0:53
https://www.youtube.com/watch?v=b9wialxvcVA
*** COMPLETED Employee IO program
    CLOSED: [2018-02-09 Fri 14:37]
    CLOCK: [2018-02-09 Fri 10:53]--[2018-02-09 Fri 11:56] =>  1:03
Read/write employee records
*** COMPLETED Test Employee IO program
    CLOSED: [2018-02-09 Fri 14:39]
    CLOCK: [2018-02-09 Fri 12:00]--[2018-02-09 Fri 13:00] =>  1:00
Test read write function
*** COMPLETED Review player class in FM
    CLOSED: [2018-02-09 Fri 15:09]
    CLOCK: [2018-02-09 Fri 14:30]--[2018-02-09 Fri 15:08] =>  0:38

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-09 Fri 15:21]
    CLOCK: [2018-02-09 Fri 15:08]--[2018-02-09 Fri 15:21] =>  0:13

*** COMPLETED Discuss code
    CLOSED: [2018-02-09 Fri 16:38]
    CLOCK: [2018-02-09 Fri 15:40]--[2018-02-09 Fri 16:20] =>  0:40

*** COMPLETED Read about Object oriented programming
    CLOSED: [2018-02-12 Mon 09:42]
    CLOCK: [2018-02-12 Mon 09:00]--[2018-02-12 Mon 09:42] =>  0:42
learncpp.com
*** COMPLETED Start league class
    CLOSED: [2018-02-12 Mon 10:40]
    CLOCK: [2018-02-12 Mon 09:52]--[2018-02-12 Mon 10:40] =>  0:48
started creating class for  leagues
*** COMPLETED Add league class to main
    CLOSED: [2018-02-12 Mon 11:10]
    CLOCK: [2018-02-12 Mon 10:40]--[2018-02-12 Mon 11:10] =>  0:30
Added league class to main

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-12 Mon 12:24]
    CLOCK: [2018-02-12 Mon 11:15]--[2018-02-12 Mon 11:45] =>  0:30

*** COMPLETED Review changes
    CLOSED: [2018-02-12 Mon 12:25]
    CLOCK: [2018-02-12 Mon 13:49]--[2018-02-12 Mon 14:20] =>  0:31
    CLOCK: [2018-02-12 Mon 11:50]--[2018-02-12 Mon 12:25] =>  0:35
Look at changes made
*** COMPLETED Add more team data to league
    CLOSED: [2018-02-12 Mon 15:22]
    CLOCK: [2018-02-12 Mon 14:45]--[2018-02-12 Mon 15:22] =>  0:37
Added more teams to league
*** COMPLETED Testing
    CLOSED: [2018-02-12 Mon 16:27]
    CLOCK: [2018-02-12 Mon 15:25]--[2018-02-12 Mon 16:27] =>  1:02

*** COMPLETED Review code/research tasks
    CLOSED: [2018-02-13 Tue 10:05]
    CLOCK: [2018-02-13 Tue 09:04]--[2018-02-13 Tue 10:05] =>  1:01

*** COMPLETED Start game class
    CLOSED: [2018-02-13 Tue 11:05]
    CLOCK: [2018-02-13 Tue 10:05]--[2018-02-13 Tue 11:05] =>  1:00
Started creating class for game/match
*** COMPLETED Discuss game and look through code
    CLOSED: [2018-02-13 Tue 11:53]
    CLOCK: [2018-02-13 Tue 11:53]--[2018-02-13 Tue 12:29] =>  0:36
    CLOCK: [2018-02-13 Tue 11:10]--[2018-02-13 Tue 11:53] =>  0:43

*** COMPLETED Add game to main
    CLOSED: [2018-02-13 Tue 13:58]
    CLOCK: [2018-02-13 Tue 12:37]--[2018-02-13 Tue 13:00] =>  0:23
Added game class to main
*** COMPLETED Read MC sample game
    CLOSED: [2018-02-13 Tue 14:44]
    CLOCK: [2018-02-13 Tue 14:19]--[2018-02-13 Tue 14:44] =>  0:25

*** COMPLETED Build and test MC game
    CLOSED: [2018-02-13 Tue 16:33]
    CLOCK: [2018-02-13 Tue 14:45]--[2018-02-13 Tue 15:45] =>  1:00

*** COMPLETED Research parts of code
    CLOSED: [2018-02-13 Tue 16:33]
    CLOCK: [2018-02-13 Tue 16:00]--[2018-02-13 Tue 16:33] =>  0:33

*** COMPLETED Research IO/Myfile
    CLOSED: [2018-02-14 Wed 10:10]
    CLOCK: [2018-02-14 Wed 09:30]--[2018-02-14 Wed 10:10] =>  0:40

*** COMPLETED Review sample program
    CLOSED: [2018-02-14 Wed 13:06]
    CLOCK: [2018-02-14 Wed 10:15]--[2018-02-14 Wed 12:15] =>  2:00
-Review program
-Breakdown code
-test code/changes
-research certain parts of code_
*** COMPLETED Fix league class
    CLOSED: [2018-02-14 Wed 13:07]
    CLOCK: [2018-02-14 Wed 12:15]--[2018-02-14 Wed 13:06] =>  0:51
-Change class to make it like sample
*** COMPLETED Check through program for errors
    CLOSED: [2018-02-14 Wed 16:49]
    CLOCK: [2018-02-14 Wed 14:00]--[2018-02-14 Wed 15:00] =>  1:00
-errors in main: extra curly
-errors in league: stray .
*** COMPLETED Practice IO
    CLOSED: [2018-02-14 Wed 16:50]
    CLOCK: [2018-02-14 Wed 15:20]--[2018-02-14 Wed 16:20] =>  1:00

*** COMPLETED Fix league
    CLOSED: [2018-02-15 Thu 10:08]
    CLOCK: [2018-02-15 Thu 09:15]--[2018-02-15 Thu 10:08] =>  0:53
-- Missing bracket at end
*** COMPLETED Look through sample main
    CLOSED: [2018-02-15 Thu 11:05]
    CLOCK: [2018-02-15 Thu 10:20]--[2018-02-15 Thu 11:05] =>  0:45

*** COMPLETED Review changes
    CLOSED: [2018-02-15 Thu 12:25]
    CLOCK: [2018-02-15 Thu 11:15]--[2018-02-15 Thu 11:30] =>  0:15

*** COMPLETED Add league function to main
    CLOSED: [2018-02-15 Thu 12:26]
    CLOCK: [2018-02-15 Thu 11:30]--[2018-02-15 Thu 12:26] =>  0:56

*** COMPLETED Fix travis error
    CLOSED: [2018-02-15 Thu 13:55]
    CLOCK: [2018-02-15 Thu 13:30]--[2018-02-15 Thu 13:55] =>  0:25

*** COMPLETED Fix travis error
    CLOSED: [2018-02-15 Thu 15:01]
    CLOCK: [2018-02-15 Thu 14:00]--[2018-02-15 Thu 14:15] =>  0:15

*** COMPLETED Make practice files
    CLOSED: [2018-02-15 Thu 16:01]
    CLOCK: [2018-02-15 Thu 14:30]--[2018-02-15 Thu 16:00] =>  1:30
-Practice implementing read/write
-Practice calling function
-Changing code to test results
*** COMPLETED Make player class
    CLOSED: [2018-02-16 Fri 11:56]
    CLOCK: [2018-02-16 Fri 10:00]--[2018-02-16 Fri 11:00] =>  1:00

*** COMPLETED Implement player class
    CLOSED: [2018-02-16 Fri 11:56]
    CLOCK: [2018-02-16 Fri 11:00]--[2018-02-16 Fri 11:56] =>  0:56

*** COMPLETED Discuss solution for view players based on team
    CLOSED: [2018-02-16 Fri 16:52]
    CLOCK: [2018-02-16 Fri 14:00]--[2018-02-16 Fri 15:00] =>  1:00
ideas: use variable for file path, or seperate function for each team

*** COMPLETED Try to implement a solution
    CLOSED: [2018-02-16 Fri 16:52]
    CLOCK: [2018-02-16 Fri 15:00]--[2018-02-16 Fri 16:52] =>  1:52

*** COMPLETED Review program
    CLOSED: [2018-02-19 Mon 10:46]
    CLOCK: [2018-02-19 Mon 09:00]--[2018-02-19 Mon 10:00] =>  1:00
-- changes to be made:
change ifs to readplayer functions
add team data

*** COMPLETED Discuss tasks/changes
    CLOSED: [2018-02-19 Mon 10:48]
    CLOCK: [2018-02-19 Mon 10:00]--[2018-02-19 Mon 10:30] =>  0:30

*** COMPLETED Add team data files
    CLOSED: [2018-02-19 Mon 11:32]
    CLOCK: [2018-02-19 Mon 10:48]--[2018-02-19 Mon 11:32] =>  0:44
*** COMPLETED Discuss solution to league table
    CLOSED: [2018-02-19 Mon 14:16]
    CLOCK: [2018-02-19 Mon 11:30]--[2018-02-19 Mon 12:15] =>  0:45

*** COMPLETED Research I/O for files
    CLOSED: [2018-02-19 Mon 14:17]
    CLOCK: [2018-02-19 Mon 12:15]--[2018-02-19 Mon 13:00] =>  0:45

*** COMPLETED Test current program
    CLOSED: [2018-02-19 Mon 15:36]
    CLOCK: [2018-02-19 Mon 14:20]--[2018-02-19 Mon 15:00] =>  0:40

*** COMPLETED Watch videos about read/write custom files
    CLOSED: [2018-02-19 Mon 15:59]
    CLOCK: [2018-02-19 Mon 15:00]--[2018-02-19 Mon 15:59] =>  0:59
https://www.youtube.com/watch?v=EjJY7yA5SWw  -- can be used to read multiple properties
of players
https://www.youtube.com/watch?v=iGWhPwh3n-o -- can be used to write custom files

*** COMPLETED Write program to practice reading custom files
    CLOSED: [2018-02-20 Tue 12:07]
    CLOCK: [2018-02-19 Mon 16:00]--[2018-02-19 Mon 16:40] => 00:40

*** COMPLETED Watch read/write videos
    CLOSED: [2018-02-20 Tue 10:46]
    CLOCK: [2018-02-20 Tue 09:00]--[2018-02-20 Tue 10:46] =>  1:46
https://youtu.be/4nz6rPzVm70
-- lost other links

*** COMPLETED Add variables to read/write program
    CLOSED: [2018-02-20 Tue 12:08]
    CLOCK: [2018-02-20 Tue 10:50]--[2018-02-20 Tue 12:08] =>  1:18

*** POSTPONED Add class to read/write program
    CLOSED: [2018-02-20 Tue 16:30]
    CLOCK: [2018-02-21 Wed 09:00]--[2018-02-21 Wed 10:17] =>  1:17
    CLOCK: [2018-02-20 Tue 14:15]--[2018-02-20 Tue 16:30] =>  2:15

*** COMPLETED Research about istream/fstream
    CLOSED: [2018-02-21 Wed 11:20]
    CLOCK: [2018-02-21 Wed 10:18]--[2018-02-21 Wed 11:20] =>  1:02

*** COMPLETED Review table.cpp
    CLOSED: [2018-02-21 Wed 14:01]
    CLOCK: [2018-02-21 Wed 11:30]--[2018-02-21 Wed 12:00] =>  0:30

*** COMPLETED Discuss tasks/data model
    CLOSED: [2018-02-21 Wed 14:02]
    CLOCK: [2018-02-21 Wed 12:00]--[2018-02-21 Wed 12:30] =>  0:30

*** COMPLETED Review sample program
    CLOSED: [2018-02-21 Wed 15:16]
    CLOCK: [2018-02-21 Wed 14:06]--[2018-02-21 Wed 15:16] =>  1:10

*** COMPLETED Watch OOP videos
    CLOSED: [2018-02-21 Wed 16:50]
    CLOCK: [2018-02-21 Wed 15:16]--[2018-02-21 Wed 16:50] =>  1:34
https://www.youtube.com/watch?v=R1jabnZ6f30 (oop way of thinking)
https://www.youtube.com/watch?v=YcbcfkLzgvs (oop turorial 1)
https://www.youtube.com/watch?v=vz1O9nRyZaY (Programming help OOP tutorial)
https://www.youtube.com/watch?v=b9wialxvcVA (Programming help (OOP tutorial pt2)
*** COMPLETED Review OOP videos
    CLOSED: [2018-02-22 Thu 09:55]
    CLOCK: [2018-02-22 Thu 09:00]--[2018-02-22 Thu 09:55] =>  0:55

*** COMPLETED Read OOP tutorial
    CLOSED: [2018-02-22 Thu 11:09]
    CLOCK: [2018-02-22 Thu 09:55]--[2018-02-22 Thu 11:09] =>  1:14

*** COMPLETED Read std::sort
    CLOSED: [2018-02-22 Thu 11:48]
    CLOCK: [2018-02-22 Thu 11:11]--[2018-02-22 Thu 11:48] =>  0:37

*** COMPLETED Read std::find
    CLOSED: [2018-02-22 Thu 13:50]
    CLOCK: [2018-02-22 Thu 11:48]--[2018-02-22 Thu 12:45] =>  0:57

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-22 Thu 14:40]
    CLOCK: [2018-02-22 Thu 13:45]--[2018-02-22 Thu 14:40] =>  0:55

*** COMPLETED Create player class
    CLOSED: [2018-02-22 Thu 15:08]
    CLOCK: [2018-02-22 Thu 14:40]--[2018-02-22 Thu 15:07] =>  0:27

*** COMPLETED Fix data model
    CLOSED: [2018-02-22 Thu 16:00]
    CLOCK: [2018-02-22 Thu 15:10]--[2018-02-22 Thu 16:00] =>  0:50

*** COMPLETED Look at PGs diagram
    CLOSED: [2018-02-22 Thu 16:45]
    CLOCK: [2018-02-22 Thu 16:00]--[2018-02-22 Thu 16:30] =>  0:30

*** COMPLETED Attempt to fix build
    CLOSED: [2018-02-23 Fri 09:42]
    CLOCK: [2018-02-23 Fri 09:42]--[2018-02-23 Fri 10:37] =>  0:55
    CLOCK: [2018-02-23 Fri 09:00]--[2018-02-23 Fri 09:42] =>  0:42

*** COMPLETED Watch istream/fsteeam/getline video
    CLOSED: [2018-02-23 Fri 14:21]
    CLOCK: [2018-02-23 Fri 11:00]--[2018-02-23 Fri 12:30] =>  1:30
https://www.youtube.com/watch?v=F9JWpTXFOzM
*** COMPLETED Review code
    CLOSED: [2018-02-23 Fri 14:21]
    CLOCK: [2018-02-23 Fri 12:30]--[2018-02-23 Fri 13:00] =>  0:30

*** COMPLETED watch getline video 2
    CLOSED: [2018-02-23 Fri 16:54]
    CLOCK: [2018-02-23 Fri 14:00]--[2018-02-23 Fri 15:00] =>  1:00

*** COMPLETED Watch OOP video
    CLOSED: [2018-02-23 Fri 16:54]
    CLOCK: [2018-02-23 Fri 15:00]--[2018-02-23 Fri 16:00] =>  1:00

*** COMPLETED Review diagram
    CLOSED: [2018-02-23 Fri 16:55]
    CLOCK: [2018-02-23 Fri 16:15]--[2018-02-23 Fri 16:55] =>  0:40

*** COMPLETED Review program
    CLOSED: [2018-02-26 Mon 11:54]
    CLOCK: [2018-02-26 Mon 09:00]--[2018-02-26 Mon 10:30] =>  1:30
-- looked through current program
-- need to add variables
-- need to read new variables
-- need to fix table class
-- reviewed diagram
*** COMPLETED watch oop playlist
    CLOSED: [2018-02-26 Mon 11:56]
    CLOCK: [2018-02-26 Mon 10:30]--[2018-02-26 Mon 11:30] =>  1:00
https://www.youtube.com/playlist?list=PLKeuJMFpWfxeLpamM60a8irUpJEjGuTwh

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-26 Mon 11:57]
    CLOCK: [2018-02-26 Mon 14:15]--[2018-02-26 Mon 15:06] =>  0:51
    CLOCK: [2018-02-26 Mon 12:00]--[2018-02-26 Mon 12:30] =>  0:30
    CLOCK: [2018-02-26 Mon 11:30]--[2018-02-26 Mon 12:00] =>  0:30
-- variables added by PG
-- Not used

*** COMPLETED Review PG changes
    CLOSED: [2018-02-26 Mon 14:33]
    CLOCK: [2018-02-26 Mon 14:00]--[2018-02-26 Mon 14:15] =>  0:15

*** COMPLETED Practice using variables from file
    CLOSED: [2018-02-27 Tue 11:21]
    CLOCK: [2018-02-27 Tue 11:30]--[2018-02-27 Tue 12:30] =>  1:00
    CLOCK: [2018-02-27 Tue 09:32]--[2018-02-27 Tue 11:21] =>  1:49
    CLOCK: [2018-02-26 Mon 15:07]--[2018-02-26 Mon 16:43] =>  1:36
-- can now display just team lists
*** COMPLETED Watch OOP video
    CLOSED: [2018-02-27 Tue 09:32]
    CLOCK: [2018-02-27 Tue 09:00]--[2018-02-27 Tue 09:31] =>  0:31

*** POSTPONED Display players of 1 team
    CLOSED: [2018-02-27 Tue 16:32]
    CLOCK: [2018-02-28 Wed 13:30]--[2018-02-28 Wed 14:46] =>  1:16
    CLOCK: [2018-02-27 Tue 13:48]--[2018-02-27 Tue 16:32] =>  2:44

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-28 Wed 09:21]
    CLOCK: [2018-02-28 Wed 09:00]--[2018-02-28 Wed 09:21] =>  0:21

*** COMPLETED Watch oop video
    CLOSED: [2018-02-28 Wed 10:14]
    CLOCK: [2018-02-28 Wed 09:21]--[2018-02-28 Wed 10:14] =>  0:53
https://www.youtube.com/watch?v=QKCfQtSX8Rg

*** COMPLETED Research objects in memory
    CLOSED: [2018-02-28 Wed 12:14]
    CLOCK: [2018-02-28 Wed 14:46]--[2018-02-28 Wed 16:46] =>  2:00
    CLOCK: [2018-02-28 Wed 10:16]--[2018-02-28 Wed 12:13] =>  1:57
https://stackoverflow.com/questions/12378271/what-does-an-object-look-like-in-memory
http://www.bogotobogo.com/cplusplus/memoryallocation.php
https://ineed.coffee/wp-content/uploads/2011/04/object-oriented-memory-management-java-c++.pdf
https://www.youtube.com/watch?v=iNuTwvD6ciI
*** COMPLETED Research class objects/ research getline
    CLOSED: [2018-03-01 Thu 12:02]
    CLOCK: [2018-03-01 Thu 09:30]--[2018-03-01 Thu 12:01] =>  2:31
https://www.ntu.edu.sg/home/ehchua/programming/cpp/cp5_OOPExamples.html
https://stackoverflow.com/questions/6182147/how-to-getline-from-specific-line-in-a-file-c

*** COMPLETED Discus tasks
    CLOSED: [2018-03-01 Thu 13:41]
    CLOCK: [2018-03-01 Thu 12:10]--[2018-03-01 Thu 12:40] =>  0:30

*** COMPLETED Research getline
    CLOSED: [2018-03-01 Thu 15:48]
    CLOCK: [2018-03-01 Thu 13:42]--[2018-03-01 Thu 14:13] =>  0:31
*** COMPLETED Add team code to main project
    CLOSED: [2018-03-01 Thu 15:48]
    CLOCK: [2018-03-01 Thu 14:20]--[2018-03-01 Thu 15:00] =>  1:00

*** COMPLETED Review program and changes
    CLOSED: [2018-03-05 Mon 11:04]
    CLOCK: [2018-03-05 Mon 09:13]--[2018-03-05 Mon 11:03] =>  1:50
-- test code
--- random values for table
-- points in data file under team name
*** COMPLETED Attempt to fix table
    CLOSED: [2018-03-05 Mon 14:00]
    CLOCK: [2018-03-05 Mon 14:00]--[2018-03-05 Mon 15:10] =>  1:10
    CLOCK: [2018-03-05 Mon 11:05]--[2018-03-05 Mon 13:05] =>  2:00
-- points are read as : Wins:0 but value displayed in table is random
-- in team.cpp variable read is number of wins, but in table.cpp its t.wins?
*** COMPLETED Review table
    CLOSED: [2018-03-05 Mon 16:14]
    CLOCK: [2018-03-05 Mon 15:15]--[2018-03-05 Mon 16:15] =>  1:00
-- need to add d/l (added by PG)
*** COMPLETED Discuss tasks
    CLOSED: [2018-03-06 Tue 09:22]
    CLOCK: [2018-03-05 Mon 16:15]--[2018-03-05 Mon 16:45] => 0:30

** Deprecated
** Notes
links to look at later:
https://www.youtube.com/watch?v=F9JWpTXFOzM
http://www.programminghelp.org/lib/c++/
